app/Models/Homemodel.php

  public function getData() {
    $builder = $this->db->table('students');
    $query   = $builder->get();
---
SELECT *
FROM `students`

  public function singleStudentData($id)
  {
    $builder = $this->db->table('students')->where('id', $id);
    $query = $builder->get();
---
SELECT *
FROM `students`
WHERE `id` = '4'